void Function()        //รวบรวมฟังก์ชันต่างๆ ที่ใช้ประจำ
{
  RobotStart();       //หุ่นยนต์ออกจากจุดเริ่มต้น
  TracJC();           //เดินเช็คแยกเมื่อถึงแยกหุ่นยนต์จะหยุดเตรียมเลี้ยว
  TracJCStop();       //เดินเช็คแยกเมื่อถึงแยกหุ่นยนต์จะหยุดทันที
  TracSpeedTime(SlowSpeed,200);   //เดินตามเส้นแบบหน่วงเวลาด้วยความเร็ว SlowSpeed นาน 200 ms(0.2 วินาที)
  ForwardSpeedTime(ACCSpeed,100);//เดินหน้าด้วยความเร็ว ACCSpeed นาน 100 ms(0.1 วินาที)
  BackwardSpeedTime(ACCSpeed,100);//ถอยหลังด้วยความเร็ว ACCSpeed นาน 100 ms(0.1 วินาที)   
  ForwardDelay(300);  //เดินหน้าด้วยความเร็วปกติ นาน 300 ms(0.3 วินาที)
  BackwardDelay(300); //ถอยหลังด้วยความเร็วปกติ นาน 300 ms(0.3 วินาที)
  delay(1000);        //หน่วงเวลา 1000 ms(1 วินาที)
  TurnLeft();         //เลี้ยวซ้าย
  TurnRight();        //เลี้ยวขวา
  UTurnLeft();        //หมุนกลับตัวทางซ้าย
  UTurnRight();       //หมุนกลับตัวทางขวา
  Right(SlowSpeed,100);   //หมุนขวาด้วยความเร็ว SlowSpeed นาน 100 ms(0.1 วินาที) 
  Left(SlowSpeed,100);     //หมุนซ้ายด้วยความเร็ว SlowSpeed นาน 100 ms(0.1 วินาที)
  KickRed();         //ปล่อยลูกบาศก์ด้านหน้า
  MotorStop();        //มอเตอร์หยุด
  Finish();           //หุ่นยนต์หยุดและจบการทำงาน พร้อมแสดงเวลาที่หุ่นยนต์ทำงานทั้งหมด

}
